package tickr

import (
	"reflect"
	"testing"
)

var text string = `শেয়ারবাজার রিপোর্ট: পরিচালনা পর্ষদ সভার তারিখ ঘোষণা করেছে পুঁজিবাজারে তালিকাভুক্ত ১২ কোম্পানি। কোম্পানিগুলো সভায়, ৩১ ডিসেম্বর, ২০১৯ সমাপ্ত সময়ের নীরিক্ষিত এবং ৩১ মার্চ ও ৩০ জুন, ২০২০ সমাপ্ত সময়ের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে। ডিএসই সূত্রে এ তথ্য জানা গেছে।

বাংলাদেশ ন্যাশনাল ইন্স্যুরেন্স কোম্পানি লিমিটেডের বোর্ড সভা ২৮ জুলাই, বিকেল ৪টায় অনুষ্ঠিত হবে। সভায় ৩০ জুন, ২০২০ সমাপ্ত সময়ের দ্বিতীয় প্রান্তিকের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে বলে জানা গেছে।

শাহ-জালাল ইসলামি ব্যাংক লিমিটেডের বোর্ড সভা ২৯ জুলাই, দুপুর ২টা ৩৫ মিনিটে অনুষ্ঠিত হবে। সভায় ৩০ জুন, ২০২০ সমাপ্ত সময়ের দ্বিতীয় প্রান্তিকের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে বলে জানা গেছে।

ইস্টার্ন ইন্স্যুরেন্স লিমিটেডের বোর্ড সভা ২৯ জুলাই, বিকেল ৩টায় অনুষ্ঠিত হবে। সভায় ৩০ জুন, ২০২০ সমাপ্ত সময়ের দ্বিতীয় প্রান্তিকের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে বলে জানা গেছে।

আইএফআইসি ব্যাংক লিমিটেডের বোর্ড সভা ২৯ জুলাই, বিকেল ৫টায় অনুষ্ঠিত হবে। সভায় ৩০ জুন, ২০২০ সমাপ্ত সময়ের দ্বিতীয় প্রান্তিকের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে বলে জানা গেছে।

ইউনাইটেড ফাইন্যান্স লিমিটেডের বোর্ড সভা ২৯ জুলাই, বিকেল ৪টায় অনুষ্ঠিত হবে। সভায় ৩০ জুন, ২০২০ সমাপ্ত সময়ের দ্বিতীয় প্রান্তিকের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে বলে জানা গেছে।

সাউথইস্ট ব্যাংক লিমিটেডের বোর্ড সভা ২৯ জুলাই, বিকেল সাড়ে ৩টায় অনুষ্ঠিত হবে। সভায় ৩০ জুন, ২০২০ সমাপ্ত সময়ের দ্বিতীয় প্রান্তিকের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে বলে জানা গেছে।

গোল্ডেন হার্ভেস্ট এগ্রো বায়োটেক ইন্ডাস্ট্রিজ লিমিটেডের বোর্ড সভা ২৯ জুলাই, বিকেল সাড়ে ৫টায় অনুষ্ঠিত হবে। সভায় ৩১ মার্চ, ২০২০ সমাপ্ত সময়ের তৃতীয়  প্রান্তিকের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে বলে জানা গেছে।

ওয়েস্টার্ন মেরিন লিমিটেডের বোর্ড সভা ৩০ জুলাই, বিকেল সাড়ে ৩টায় অনুষ্ঠিত হবে। সভায় ৩১ মার্চ, ২০২০ সমাপ্ত সময়ের তৃতীয়  প্রান্তিকের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে বলে জানা গেছে।

কনফিডেন্স সিমেন্ট লিমিটেডের বোর্ড সভা ৩০ জুলাই, বিকেল ৩টায় অনুষ্ঠিত হবে। সভায় ৩১ মার্চ, ২০২০ সমাপ্ত সময়ের তৃতীয়  প্রান্তিকের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে বলে জানা গেছে।

ব্র্যাক ব্যাংক লিমিটেডের বোর্ড সভা ৩০ জুলাই, বিকেল ৩টায় অনুষ্ঠিত হবে। সভায় ৩০ জুন, ২০২০ সমাপ্ত সময়ের দ্বিতীয় প্রান্তিকের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে বলে জানা গেছে।

গ্রীনডেল্টা ইন্স্যুরেন্স লিমিটেডের বোর্ড সভা ৩০ জুলাই, বিকেল ৪টায় অনুষ্ঠিত হবে। সভায় ৩০ জুন, ২০২০ সমাপ্ত সময়ের দ্বিতীয় প্রান্তিকের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে বলে জানা গেছে।

পদ্মা লাইফ ইন্স্যুরেন্স লিমিটেডের বোর্ড সভা ৩০ জুলাই, দুপুর ২টা ৩৫ মিনিটে অনুষ্ঠিত হবে। সভায় ৩১ ডিসেম্বর, ২০১৯ সমাপ্ত অর্থবছরের নীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য ডিভিডেন্ড ঘোষণা আসতে পারে বলে জানা গেছে। একই সভায় ৩১ মার্চ, ২০২০ সমাপ্ত সময়ের প্রথম  এবং ৩০ জুন, ২০২০ সমাপ্ত সময়ের দ্বিতীয় প্রান্তিকের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে বলে জানা গেছে।
েয়ারবাজার রিপোর্ট: পরিচালনা পর্ষদ সভার তারিখ ঘোষণা করেছে পুঁজিবাজারে তালিকাভুক্ত ১২ কোম্পানি। কোম্পানিগুলো সভায়, ৩১ ডিসেম্বর, ২০১৯ সমাপ্ত সময়ের নীরিক্ষিত এবং ৩১ মার্চ ও ৩০ জুন, ২০২০ সমাপ্ত সময়ের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে। ডিএসই সূত্রে এ তথ্য জানা গেছে।

বাংলাদেশ ন্যাশনাল ইন্স্যুরেন্স কোম্পানি লিমিটেডের বোর্ড সভা ২৮ জুলাই, বিকেল ৪টায় অনুষ্ঠিত হবে। সভায় ৩০ জুন, ২০২০ সমাপ্ত সময়ের দ্বিতীয় প্রান্তিকের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে বলে জানা গেছে।

শাহ-জালাল ইসলামি ব্যাংক লিমিটেডের বোর্ড সভা ২৯ জুলাই, দুপুর ২টা ৩৫ মিনিটে অনুষ্ঠিত হবে। সভায় ৩০ জুন, ২০২০ সমাপ্ত সময়ের দ্বিতীয় প্রান্তিকের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে বলে জানা গেছে।

ইস্টার্ন ইন্স্যুরেন্স লিমিটেডের বোর্ড সভা ২৯ জুলাই, বিকেল ৩টায় অনুষ্ঠিত হবে। সভায় ৩০ জুন, ২০২০ সমাপ্ত সময়ের দ্বিতীয় প্রান্তিকের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে বলে জানা গেছে।

আইএফআইসি ব্যাংক লিমিটেডের বোর্ড সভা ২৯ জুলাই, বিকেল ৫টায় অনুষ্ঠিত হবে। সভায় ৩০ জুন, ২০২০ সমাপ্ত সময়ের দ্বিতীয় প্রান্তিকের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে বলে জানা গেছে।

ইউনাইটেড ফাইন্যান্স লিমিটেডের বোর্ড সভা ২৯ জুলাই, বিকেল ৪টায় অনুষ্ঠিত হবে। সভায় ৩০ জুন, ২০২০ সমাপ্ত সময়ের দ্বিতীয় প্রান্তিকের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে বলে জানা গেছে।

সাউথইস্ট ব্যাংক লিমিটেডের বোর্ড সভা ২৯ জুলাই, বিকেল সাড়ে ৩টায় অনুষ্ঠিত হবে। সভায় ৩০ জুন, ২০২০ সমাপ্ত সময়ের দ্বিতীয় প্রান্তিকের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে বলে জানা গেছে।

গোল্ডেন হার্ভেস্ট এগ্রো বায়োটেক ইন্ডাস্ট্রিজ লিমিটেডের বোর্ড সভা ২৯ জুলাই, বিকেল সাড়ে ৫টায় অনুষ্ঠিত হবে। সভায় ৩১ মার্চ, ২০২০ সমাপ্ত সময়ের তৃতীয়  প্রান্তিকের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে বলে জানা গেছে।

ওয়েস্টার্ন মেরিন লিমিটেডের বোর্ড সভা ৩০ জুলাই, বিকেল সাড়ে ৩টায় অনুষ্ঠিত হবে। সভায় ৩১ মার্চ, ২০২০ সমাপ্ত সময়ের তৃতীয়  প্রান্তিকের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে বলে জানা গেছে।

কনফিডেন্স সিমেন্ট লিমিটেডের বোর্ড সভা ৩০ জুলাই, বিকেল ৩টায় অনুষ্ঠিত হবে। সভায় ৩১ মার্চ, ২০২০ সমাপ্ত সময়ের তৃতীয়  প্রান্তিকের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে বলে জানা গেছে।

ব্র্যাক ব্যাংক লিমিটেডের বোর্ড সভা ৩০ জুলাই, বিকেল ৩টায় অনুষ্ঠিত হবে। সভায় ৩০ জুন, ২০২০ সমাপ্ত সময়ের দ্বিতীয় প্রান্তিকের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে বলে জানা গেছে।

গ্রীনডেল্টা ইন্স্যুরেন্স লিমিটেডের বোর্ড সভা ৩০ জুলাই, বিকেল ৪টায় অনুষ্ঠিত হবে। সভায় ৩০ জুন, ২০২০ সমাপ্ত সময়ের দ্বিতীয় প্রান্তিকের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে বলে জানা গেছে।

পদ্মা লাইফ ইন্স্যুরেন্স লিমিটেডের বোর্ড সভা ৩০ জুলাই, দুপুর ২টা ৩৫ মিনিটে অনুষ্ঠিত হবে। সভায় ৩১ ডিসেম্বর, ২০১৯ সমাপ্ত অর্থবছরের নীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য ডিভিডেন্ড ঘোষণা আসতে পারে বলে জানা গেছে। একই সভায় ৩১ মার্চ, ২০২০ সমাপ্ত সময়ের প্রথম  এবং ৩০ জুন, ২০২০ সমাপ্ত সময়ের দ্বিতীয় প্রান্তিকের অনীরিক্ষিত আর্থিক প্রতিবেদন পর্যালোচনার পাশাপাশি বিনিয়োগকারীদের জন্য প্রকাশ করা হবে বলে জানা গেছে।`

func BenchmarkTicker_Get(b *testing.B) {
	t, _ := New()
	for n := 0; n < b.N; n++ {
		t.Get(text)
	}
}

func TestTicker_Get(t *testing.T) {
	tests := map[string]struct {
		input string
		want  map[string]int
	}{
		"RUPALIBANK: one ticker":                     {input: "রূপালী ব্যাংকের দ্বিতীয় প্রান্তিক প্রকাশ", want: map[string]int{"RUPALIBANK": 1}},
		"BANKASIA: one ticker":                       {input: "ব্যাংক এশিয়ার দ্বিতীয় প্রান্তিক প্রকাশ", want: map[string]int{"BANKASIA": 1}},
		"no ticker":                                  {input: "টোলারবাগ-পূর্ব রাজাবাজারের পর লকডাউনে সাফল্য ওয়ারীতেও", want: map[string]int{}},
		"BATBC: same ticker twice":                   {input: "রূপালী ব্যাংকের প্রথম প্রান্তিক প্রকাশ এবং  রূপালী ব্যাংকের", want: map[string]int{"RUPALIBANK": 2}},
		"BATBC: one ticker with punctuation in text": {input: "ব্রিটিশ! আমেরিকান টোব্যাকোঃ  দ্বিতীয়? প্রান্তিক প্রকাশ!", want: map[string]int{"BATBC": 1}},
		"two ticker in single text": {input: "প্রাইম ইন্স্যুরেন্সের দ্বিতীয় প্রান্তিক প্রকাশ এবং	ব্রিটিশ! আমেরিকান টোব্যাকোঃ  দ্বিতীয়? প্রান্তিক প্রকাশ!", want: map[string]int{"PRIMEINSUR": 1, "BATBC": 1}},
		"NBL:english text": {input: "National Bank publishes 2nd quarterly report", want: map[string]int{"NBL": 1}},
		"ticker extraction from large text": {input: text, want: map[string]int{"SHAHJABANK": 2, "EASTERNINS": 2, "IFIC": 2,
			"WMSHIPYARD": 2, "GREENDELT": 2, "PADMALIFE": 2, "BNICL": 2, "SOUTHEASTB": 2, "GHAIL": 2, "CONFIDCEM": 2, "BRACBANK": 2, "UNITEDFIN": 2}},
	}

	ticker, _ := New()
	for name, tc := range tests {
		t.Run(name, func(t *testing.T) {
			got := ticker.Get(tc.input)
			if !reflect.DeepEqual(tc.want, got) {
				t.Fatalf("expected: %v, got: %v", tc.want, got)
			}
		})
	}
}
